Public Attributes | List of all members
API_RailingToprailConnectionQuantity Struct Reference
Element Manager API
Calculated values for the top rail connection. More...
#include <APIdefs_Elements.h>
 Public Attributes
double  | volume
Volume of the top rail connection.
double  | length3D
Length of the 3D reference line of the top rail connection.
Detailed Description
Calculated values for the top rail connection.
Member Data Documentation
◆ length3D
 API_RailingToprailConnectionQuantity::length3D
Length of the 3D reference line of the top rail connection.
◆ volume
 API_RailingToprailConnectionQuantity::volume
Volume of the top rail connection.